In [1]:
import pandas as pd
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [2]:
ufo['Colors Reported'].unique()

array([nan, 'RED', 'GREEN', 'BLUE', 'ORANGE', 'YELLOW', 'ORANGE YELLOW',
       'RED GREEN', 'RED BLUE', 'RED ORANGE', 'RED GREEN BLUE',
       'RED YELLOW GREEN', 'RED YELLOW', 'GREEN BLUE', 'ORANGE GREEN BLUE',
       'ORANGE GREEN', 'YELLOW GREEN', 'RED YELLOW BLUE', 'ORANGE BLUE',
       'RED YELLOW GREEN BLUE', 'YELLOW GREEN BLUE', 'RED ORANGE YELLOW',
       'RED ORANGE YELLOW BLUE', 'YELLOW BLUE', 'RED ORANGE GREEN',
       'RED ORANGE BLUE', 'ORANGE YELLOW GREEN', 'ORANGE YELLOW BLUE'], dtype=object)

In [3]:
ufo.isnull().head()

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False

In [4]:
ufo.isnull().tail()

        City  Colors Reported  Shape Reported  State   Time
18236  False             True           False  False  False
18237  False             True           False  False  False
18238  False             True            True  False  False
18239  False            False           False  False  False
18240  False             True           False  False  False

In [5]:
ufo.notnull().tail()

       City  Colors Reported  Shape Reported  State  Time
18236  True            False            True   True  True
18237  True            False            True   True  True
18238  True            False           False   True  True
18239  True             True            True   True  True
18240  True            False            True   True  True

In [6]:
ufo.isnull().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [7]:
ufo[ufo.City.isnull()].head()

    City Colors Reported Shape Reported State             Time
21   NaN             NaN            NaN    LA   8/15/1943 0:00
22   NaN             NaN          LIGHT    LA   8/15/1943 0:00
204  NaN             NaN           DISK    CA  7/15/1952 12:30
241  NaN            BLUE           DISK    MT   7/4/1953 14:00
613  NaN             NaN           DISK    NV   7/1/1960 12:00

In [8]:
ufo['Shape Reported'].value_counts()

LIGHT        2803
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
CRESCENT        2
ROUND           2
PYRAMID         1
FLARE           1
HEXAGON         1
DOME            1
Name: Shape Reported, dtype: int64

In [9]:
ufo['Shape Reported'].value_counts(dropna=False)

LIGHT        2803
NaN          2644
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
CRESCENT        2
ROUND           2
PYRAMID         1
FLARE           1
HEXAGON         1
DOME            1
Name: Shape Reported, dtype: int64

In [10]:
ufo.shape

(18241, 5)

In [11]:
ufo.dropna(how='any').shape

(2486, 5)

In [12]:
ufo.dropna(how='all').shape

(18241, 5)

In [13]:
ufo.dropna(subset=['Colors Reported', 'Shape Reported', 'City'], how='all').shape

(18238, 5)

In [14]:
ufo.dropna(subset=['Colors Reported', 'Shape Reported', 'City'], how='any').shape

(2486, 5)

In [15]:
ufo.dropna(subset=['Colors Reported', 'Shape Reported'], how='any').shape

(2490, 5)

In [16]:
ufo['Shape Reported'].fillna(method='ffill').value_counts(dropna=False)

LIGHT        3314
DISK         2404
TRIANGLE     2376
OTHER        1635
CIRCLE       1566
SPHERE       1213
FIREBALL     1199
OVAL          965
CIGAR         698
FORMATION     503
VARIOUS       369
RECTANGLE     361
CYLINDER      354
CHEVRON       281
DIAMOND       274
EGG           229
FLASH         209
TEARDROP      141
CONE           81
CROSS          40
DELTA          17
ROUND           6
CRESCENT        2
PYRAMID         1
FLARE           1
HEXAGON         1
DOME            1
Name: Shape Reported, dtype: int64

In [17]:
ufo['Shape Reported'].fillna(value='Various').value_counts(dropna=False)

LIGHT        2803
Various      2644
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
CRESCENT        2
ROUND           2
PYRAMID         1
FLARE           1
HEXAGON         1
DOME            1
Name: Shape Reported, dtype: int64

In [18]:
ufo['Shape Reported'].describe()

count     15597
unique       27
top       LIGHT
freq       2803
Name: Shape Reported, dtype: object

In [19]:
ufo['Shape Reported'].fillna(value='LIGHT').value_counts().head()

LIGHT       5447
DISK        2122
TRIANGLE    1889
OTHER       1402
CIRCLE      1365
Name: Shape Reported, dtype: int64